/*
 *   데이터 저장방법 
 *   -----------
 *   변수 => 한개 저장 
 *   -------------------------
 *   배열 => 같은 데이터형 여러개 
 *   클래스 => 다른 데이터형 여러개 
 *   -------------- 5장 
 *   => 관련된 데이터 모아서 관리 
 *   
 *   -----------------------------
 *   데이터 가공 (사용자 요청에 따라 처리) 
 *   연산자 / 제어문 
 *   
 *   -----------------------------
 *   출력 방법 / 입력 방법 
 *             Scanner / JOptionPane / Random
 *   System.out.println()
 *   System.out.print()
 *   System.out.printf()
 *   -------------- 변경 
 *   
 *   *** 데이터 모우는 방법 / 명령문을 모우는 방법 
 *       --------------   |
 *       | 배열              메소드
 *   ----------------------- > 재사용 / 유지보수 편리 
 *   예) 지니뮤직 => 멜론
 *       CGV  => 메가박스 / 롯데시네마  
 *   -----------------
 *   for => 2차 for
 *   while 
 *   break
 *   ----------------- 형식 / 동작 순서 
 *   연산자 : ++,--,형변환 
 *          산술 / 비교 / 논리 / 대입 
 *   조건문 : if / if~else
 *   반복문 : for / while
 *   반복제어 : break
 *   
 */
public class 제어문_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
