/*
 *    ***변수 / 데이터형 
 *    ***연산자 / 제어문 
 *    -------------
 *    | 배열 / ***메소드 ********
 *    -------------
 *    문자열 / 문자열 배열 
 *    ----------------
 *    사용자 정의 데이터형 : 클래스 
 *    ----------------------- + 기능 => 객체 지향 프로그램 
 *    클래스 == 클래스 
 *          | 인터페이스 
 *    -----------------------
 *    예외처리 
 *    -----------------------
 *    기타 기능 
 *      = 어노테이션 
 *      = 열거형 
 *      = 람다식 
 *    ----------------------
 *    라이브러리 
 *      : 컬렉션 
 *      : IO 
 *      : 네트워크 
 *      : 데이터베이스 
 *    ----------------------- 웹에서 응용 / 오라클 연동 
 *    
 *   1. 형식 
 *    --- 
 *         [접근지정어][제어어] 리턴형 메소드명(매개변수...)
 *                          -----      ------------ 여러개 사용이 가능 
 *                                     ------------ 3개이상 배열/클래스
 *                          모든 데이터형/배열/클래스:한개만 사용이 가능 
 *         {
 *             구현 
 *             return 값; ==> void는 생략이 가능 
 *         }
 *         ==> 파이썬 => 리턴을 여러개가 가능 
 *         
 *         def print():
 *            return 100,20,30,40,50
 *         a,b,c,d,e=print()
 *         ----------------------------------
 *         
 *   2. 제작 여부 
 *      => 재사용 / 다른 클래스와 연결 
 *      => 객체지향프로그램 : 여러개의 클래스를 조합해서 만든다 
 *      => 분산 (여러명이 동시에 개발이 가능) 
 *         ---------------------------
 *         
 *   3. 응용 => 리턴형 / 매개변수
 *                    | 사용자가 보내주는 값
 *             | 처리 결과값 
 *   4. 호출 => 메소드명(값,값...)
 *   ------------- 메소드 : 긴소스를 나눠주는 역할
 *   5. 호출되면 무조건 메소드 처음부터 수행  
 *   ---------------------------------------
 *   
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
