/*
 *   프로그램 순서 
 *   데이터저장 =========== 데이터 가공 ========== 화면 출력 
 *   --------            ---------           --------
 *                        연산자/제어문         System.out.println()
 *   ***변수 : 데이터 한개 저장                   System.out.print() 
 *   배열 : 같은 데이터 여러개 저장                System.out.printf()
 *         ------------------                      |
 *         일차원배열                               브라우저 : HTML
 *   클래스 : 다른 데이터 여러개 저장                    윈도우 / 모바일 
 *          => 사용자 정의 데이터 
 *          
 *   변수 : 한개의 데이터 저장 
 *         --------------
 *         메모리 크기 결정 
 *         -------- 기본형 (데이터형,자료형) 
 *   *** 
 *       정수 
 *         byte (1byte) => -128~127
 *                  => 파일 업로드 / 다운로드 
 *                  => 네트워크 전송 
 *         int  (4byte) => -21억 4천 ~ 21억 4천
 *                  => 일반 정수  
 *         long (8byte) => 빅데이터
 *                  => 통계 / 회계 ... 금융권 / 공기업 
 *         ****** 컴퓨터는 모든 정수를 int로 인식이 된다 
 *         ****** int / long 
 *                => L(l) 
 *       실수 
 *         double : 8byte ==> 숫자중에 가장 큰데이터형 
 *                  소수점이 필요시에 사용 => 정밀도 소수점이하 15자리
 *       논리 
 *         boolean : true/false만 저장할 수 있다 
 *                   조건식 
 *       문자
 *         char : 2byte => 0~65535 => 멀티바이트 (유니코드)
 *                         => UTF-8
 *                => 각국의 언어 사용이 가능 
 *                => 모든 운영체제에 호환 
 *       문자열 : char여러개를 묶어서 사용 
 *         String : char[] => 기능을 가지고 있다 
 *           | 데이터형 + 클래스형 
 *       *** 웹/네트워크는 모든 데이터가 문자열이다 
 *           ----------------------------- 변환 
 *            valueOf()
 *            
 *       => 웹 : String , double , int
 *       
 *     *** 변수명 설정 (식별자) => 메소드 , 클래스 , 인터페이스 적용 
 *     1) 알파벳,한글로 시작한다 
 *        ----- 대소문자 구분한다 (웹,네트워크 ,데이터베이스) 
 *                            => 한글 자제 
 *     2) 숫자 사용이 가능 (앞에서 사용 금지) 
 *     3) 키워드는 사용할 수 없다 (자바에서 사용되는 단어) 
 *        => 색상이 빨간색 (예약어)
 *     4) 공백을 포함할 수 없다
 *     5) 특수문자 사용 (_ , $) 
 *     -----------------------
 *     가독성(리팩토링) 
 *     ------------ 약속
 *     클래스/인터페이스는 대문자로 시작한다 
 *     메소드/변수는 소문자로 시작한다 
 *     상수는 모두 대문자로 한다 
 *     *** 단어가 2개이상 => 시작단어 대문자로 사용 
 *         MainClass , FileName ...
 *     들여쓰기 
 *     --------------------------------------
 *     데이터 가공 : 연산자 / 제어문 
 *     단항연산자 
 *       = 증감연산자 (++,--) +1,-1 => 반복문에서 주로 사용 
 *       = 형변환 연산자 (데이터형)
 *         => 규칙 
 *            1) 가장 큰데이터형으로 변환
 *               int + double 
 *               ---
 *               double
 *            2) int이하 연산자 
 *               byte , char , short => 연산 결과는 int
 *            3) 자동 형변환 : 작은 데이터형 ==> 큰데이터형으로 전송
 *               강제 형변환 : 큰 데이터형 ==> 작은 데이터형으로 변경
 *               --------------> 자동 
 *               byte<char<int<long<double
 *               <------------- 강제 
 *               ** boolean은 제외가 된다 
 *               ** 클래스 형변환 
 *       = 부정연산자 => 조건문을 만드는 경우 
 *    이항연산자 
 *       = 산술연산자 (+ , - , * , / , %)
 *         + : 두개의 기능 
 *             덧셈 , 문자열 결합 
 *             "7"+7 => "77"
 *         / : 정수/정수=정수 ==> 소수점 제외 
 *             0으로 나누면 => Infinity => 무대한 
 *         % : 결과값은 왼쪽부호 동일 
 *             %0.0 ==> NaN 
 *         => 통계 (합,평균) 
 *       = 비교연산자 (== , != , < , > , <= , >=)
 *                  ---
 *                  오라클 : = 
 *                  자바스크립트 : ===
 *                  JSP : eq / ne
 *         => 조건식 만들때 주로 사용 
 *       = 논리 연산자 ( && , || )
 *                    ---  ---
 *                    직렬  병렬
 *                     |    | ==> 한쪽이상이 true 
 *                    true (두개)
 *          (조건) && (조건)
 *                   ------ 처리하지 않는다 
 *           | false면 
 *           
 *          (조건) || (조건)
 *           | true  ----- 처리하지 않는다 
 *        = 대입연산자 (= , += , -=) 
 *                       --- 누적
 *      삼항연산자 
 *        (조건) ? 값1:값2 
 *          true => 값1 
 *          false => 값2 
 *          ================= if~else 
 *          | 복잡한 프로그램 / 언어를 섞어서 사용 
 *                          --------------
 *                          웹 : HTML + Java 
 *     제어문 
 *       조건문 
 *         = 단일 조건문 
 *            if(조건) 
 *            {
 *               실행문장 => 조건 true일때만 수행 
 *               =>  오류 처리 => 사용자가 잘못된 입력 
 *                   --------------------------
 *                   | => 유효성 검사 
 *            }
 *         = 선택 조건문
 *            if(조건)
 *            {
 *               조건 true
 *            }
 *            else
 *            {
 *               조건 false 
 *            } 
 *            ============> 웹 로그인여부 / 관리자,사용자...
 *            일반 프로그램은 건너뛴다 
 *            => 웹 => 화면 => 값을 전송 
 *            => HTML은 UI => 기능 첨부 (자바) 
 *               -------------------------- JSP => ThymeLeaf
 *                   => React 변환 , VueJS => HTML기반 
 *                   
 *         = 다중 조건문 
 *           => 한개의 조건만 수행
 *           if(조건)
 *           {
 *              true => 처리하고 종료 
 *              false
 *           }        |
 *           else if(조건)
 *           {
 *              true => 처리하고 종료 
 *              false
 *           }        |
 *           ...
 *           else
 *           {
 *             조건이 없는 경우에 처리 
 *           }
 *       선택문 
 *         = switch => 다중 조건문을 단순화 
 *           : + break ==> ->
 *       반복문 
 *         = for : 어디에서 어디까지 : 반복횟수 지정 
 *                  1     2    4
 *             for(초기값;조건식;증가식)
 *                실행문장 3 =============> 조건이 false종료
 *             1 2 3 4
 *               2 3 4
 *               2 3 4 => 2번 false 종료  
 *         = while : 반복횟수가 없는 경우 : 데이터베이스 / 파일 
 *           초기값 -------- 1 
 *           while(조건식) -- 2
 *           {
 *              실행문장  --- 3
 *              증가식 ----4 
 *           }
 *           1 2 3 4
 *             2 3 4
 *             2 3 4
 *             ======> 2번 false 종료
 *         = do~while
 *           초기값 -------- 1
 *           do
 *           {
 *              실행문장 ---- 2
 *              증가식 ------ 3
 *           }while(조건식);---4
 *           
 *       반복제어문  
 *         = break : switch , 반복문 => 제어문을 종료 
 *         = continue : 반복문안에서만 사용 
 *                      특정 부분을 제외하고 처리 
 *     --------------------------- 데이터 가공 
 *     5장 => 데이터를 모아서 관리 => 배열 / 클래스 
 *            
 *       
 */
import java.awt.*;
import java.awt.event.KeyEvent;
import java.awt.event.KeyListener;

import javax.swing.*;
public class 정리1_4 extends JFrame implements KeyListener{
    GameView gv=new GameView();
    public 정리1_4()
    {
    	add("Center",gv);
    	setSize(800, 600);
    	setVisible(true);
    	addKeyListener(this);
    	
    }
	public static void main(String[] args) {
		// TODO Auto-generated method stub
        new 정리1_4();
	}
	@Override
	public void keyTyped(KeyEvent e) {
		// TODO Auto-generated method stub
		
	}
	@Override
	public void keyPressed(KeyEvent e) {
		// TODO Auto-generated method stub
	 if(e.getSource()==this)
	 {
		switch(e.getKeyCode())
		{
		case KeyEvent.VK_RIGHT:
			System.out.println(111);
			gv.x+=5;
			if(gv.x>800)
				gv.x=0;
			gv.repaint();
		}
	 }
	}
	@Override
	public void keyReleased(KeyEvent e) {
		// TODO Auto-generated method stub
		
	}

}
