/*
 *    변수 / 배열  ==> 데이터를 저장하는 용도 
 *          | => 데이터가 많은 경우 (파일,크롤링,오라클) 
 *               ------------------------------- 읽기/검색
 *    | 일반변수 = 사용자가 입력할때 저장 
 *       => 초기화 
 *       => 명시적 (임의로 결정) => 0,1
 *       => 입력값을 받는 경우 Scanner 
 *       => 난수 
 *       => 파일 읽기 ==> 배열
 *       => 크롤링   ==> 배열 
 *    | 루프변수 = i,j
 *    | 누적변수 = sum ====> sum+=i
 *    | 갯수변수 = count ===> count++
 *   => 어떤 데이터 저장 
 *      --------- 데이터형 
 *      int , long , double , String , boolean 
 *                            ------ 배열 
 *      배열은 같은 유형 데이터가 3개이상이면 
 *      --- + for 
 *   --------------- 데이터 저장 방법 --------------
 *   데이터 가공 : 연산자 / 제어문 
 *   
 *   연산자 
 *     증감연산자 (++,--) / 부정연산자 (!) ==> 조건문을 만들 경우
 *     -----> 1개 증가 / 1개 감소
 *     형변환 연산자 ==> double=>int / 클래스 형변환 (라이브러리 사용이 가능)
 *      | ==> 자동 형변환 (제네릭)  
 *     
 *     산술연산자 : 통계 => 장바구니 / 결제 금액 => 단독으로 사용 
 *               +,-,*,/,%
 *     비교연산자/논리연산자 => 조건문 만들때 
 *      | == , != , < , > , <= , >= ==> && ||
 *      && => 포함 , || => 포함이 안된 경우 => 잘못된 입력 
 *      --          --
 *       => 로그인    => 필터 (체크박스) 
 *     대입연산자 = 결과값을 받아서 => 브라우저로 전송 
 *       | 누적 : +=(장바구니 추가) , -=(장바구니 삭제)
 *     ------------------ 연산자 -----------------
 *     
 *     조건문 : 검색 ,  
 *            상세보기 
 *            if(조건문)
 *            {
 *               검색 / 상세보기 
 *            } 
 *            
 *            로그인 , 아이디 찾기 , 비밀번호 찾기
 *            if(조건)
 *            {
 *            }
 *            else
 *            {
 *            }
 *            
 *            메뉴가 있는 경우 
 *            => 한개만 실행 
 *            다중 조건문 / switch : Front-End
 *            | Back-End : 데이터베이스
 *       반복문 
 *         = for =====> Front-End (화면 UI)
 *           => 목록 / 이미지 슬라이싱 
 *           
 *         = while ===> Back-End (데이터베이스 , 크롤링)
 *           => 파일 읽기 
 *       반복제어문 
 *         = break : back-end => 데이터가 많은 경우 
 *         
 *     -----> 크롤링 (데이터 수집) 
 *            ---------------- HTML/CSS
 *            .title  class="title" id="title"
 *                                  #title
 *     -----> 페이징 기법 (****** 필수 면접 ******)
 *            인라인뷰 / Limit 
 *            
 *     SUN  /  MS 
 *      |       |
 *      ---------
 *      무료 => 운영체제 / 윈도우 .... MYSQL을 인수 => 부도
 *                                 | 개발자 불안 ==> MariaDB
 *                                ------------------
 *                                | 오라클 
 *      --------------------------------------------------
 *      
 *      String / String 배열 
 *      클래스 => 사용자 정의 
 *      
 *      => 메소드 
 *      => 객체 개념 
 *      
 *      
 *      
 *     
 *     
 */
import java.util.*;
public class 형식_사용처정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        
	}

}
