/*
 *   절차적언어 --------------> 구조적언어
 *   => main안에서 전체 코딩     => 기능별로 나눠서 작업 
 *                              ------------메소드 
 *                            |
 *                            |
 *                            |
 *                        객체지향프로그램 (자바)
 *                        => 매개변수가 거의 없다 
 *                        => 공통으로 사용하는 변수 => 멤버변수
 *                        -----------------------------
 *                        1) 변수의 종류 
 *                           = 인스턴스 변수
 *                           = 공통(공유)변수
 *                           = 지역변수 
 *                          --------------- 데이터를 보호
 *                          캡슐화 
 *                        2) 메모리 저장 : 생성자 
 *                        3) 기능 : 메소드 
 *                           ----------- 변경(오버라이딩)
 *                        -----------------------------
 *                        | 재사용 => 포함 / 상속
 *                 ------- 클래스 많이 생성 
 *                         => 한개의 이름으로 제어 => 인터페이스 
 *                 ------- 예외처리 
 *      -------------------------------------------------
 *      | 디자인 패턴 / 알고리즘 
 *        --------- 29 => 8개 (Spring)
 *        --------- Spring (자체 개발)
 *        
 *   => 변수 / 데이터형 
 *   => 연산자 / 제어문 
 *   => 배열 / 메소드 
 *   --------------- 주석 처리 
 *   
 *                        
 */
public class 정리_03_17 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
